{
  "channel_name": "BBC Radio 6 Music",
  "channel_logo": "https://raw.githubusercontent.com/dp247/mediaportal-uk-logos/master/Radio/BBC-Radio-6-Music.png",
  "schedule": [
    {
      "date": "21 February 2026",
      "programmes": [
        {
          "show_name": "6 Music's Rave Forever",
          "show_description": "(Some of) the best tracks to have soundtracked dance floors over the last 25 years!",
          "show_logo": "",
          "start_time": "00:00",
          "end_time": "01:00"
        },
        {
          "show_name": "Forever Dark",
          "show_description": "6 Music takes you to the dark side with a playlist of the finest goth, electronic and dark pop music, with tracks from Peter Murphy, The Walker Brothers, Yugen Blakrok and PVA.",
          "show_logo": "",
          "start_time": "01:00",
          "end_time": "02:00"
        },
        {
          "show_name": "Indie Forever Disco with Beth Ditto",
          "show_description": "Bringing the club vibes to you - wherever you are, whenever you want. Upbeat music to transport you to the dance floor from M83, Radio 4 and Scissor Sisters.",
          "show_logo": "",
          "start_time": "02:00",
          "end_time": "04:00"
        },
        {
          "show_name": "Ambient Focus",
          "show_description": "Carefully crafted two hour ambient mix of blissful sounds to transport you into a deep focus.",
          "show_logo": "",
          "start_time": "04:00",
          "end_time": "06:00"
        },
        {
          "show_name": "Afrodeutsche",
          "show_description": "Ease into your Saturday with AFRODEUTSCHE - the ultimate soft-launch for your weekend. Two hours of deep-listening tracks designed to ground you before the weekend truly begins.",
          "show_logo": "",
          "start_time": "06:00",
          "end_time": "08:00"
        },
        {
          "show_name": "Radcliffe and Maconie",
          "show_description": "Mark and Stuart present a feast of great music, and comedian Mike Wozniak shares his 'First, Last and Everything' and chats about his latest tour.",
          "show_logo": "",
          "start_time": "08:00",
          "end_time": "10:00"
        },
        {
          "show_name": "Deb Grant",
          "show_description": "Deb Grant sets you up for the weekend with a wild mix of amazing music genres and vibes. Including ace sounds from Cymande, The Revolutionaries, Metallica, Dead Prez and Nick Drake.",
          "show_logo": "",
          "start_time": "10:00",
          "end_time": "13:00"
        },
        {
          "show_name": "Jamz Supernova",
          "show_description": "Jamz celebrates Lunar New Year with a special show spotlighting East Asian sounds and culture. With Jianbo, Sonia Callico, Oil Club, Byyb Radio, Howie Lee, Tzusing and more.",
          "show_logo": "",
          "start_time": "13:00",
          "end_time": "15:00"
        },
        {
          "show_name": "Gilles Peterson",
          "show_description": "Gilles shares highlights from his recent trip to the Windy City, including a gospel mix from Tone B Nimble and words from Joshua Abrams, The Bajas, and Jana Rush.",
          "show_logo": "",
          "start_time": "15:00",
          "end_time": "18:00"
        },
        {
          "show_name": "The Craig Charles Funk and Soul Show",
          "show_description": "Putting down the Trunk of Funk is Diogo Strausz, a seriously talented Brazilian producer whose latest record nods to the trailblazing 80s Brazilian sound.",
          "show_logo": "",
          "start_time": "18:00",
          "end_time": "21:00"
        },
        {
          "show_name": "Don Letts' Culture Clash Radio",
          "show_description": "Don's Saturday night selections cross time, space and genre. This weekend, he's got new numbers by Reggae Roast, Daniel Avery, Lexa Gates, Invisible System and Kumail.",
          "show_logo": "",
          "start_time": "21:00",
          "end_time": "23:00"
        },
        {
          "show_name": "SHERELLE",
          "show_description": "It's all about the breaks and late-night rollers as SHERELLE soundtracks your Saturday evening...",
          "show_logo": "",
          "start_time": "23:00",
          "end_time": "00:30"
        }
      ]
    },
    {
      "date": "22 February 2026",
      "programmes": [
        {
          "show_name": "The Sweatbox",
          "show_description": "Up-and-coming producer and junglist SIMMS steps up to the Sweatbox with half an hour of original productions.",
          "show_logo": "",
          "start_time": "00:30",
          "end_time": "01:00"
        },
        {
          "show_name": "6 Music's Rave Forever",
          "show_description": "20 years on from Mary Anne Hobbs' Dubstep Warz, Rave Forever pays homage to the sound at its peak.",
          "show_logo": "",
          "start_time": "01:00",
          "end_time": "02:00"
        },
        {
          "show_name": "The Morning After Mix",
          "show_description": "Joy Anonymous select the best tracks to unwind to as well as creating their very own unique ambient mini mix in this Morning After Mix!",
          "show_logo": "",
          "start_time": "02:00",
          "end_time": "04:00"
        },
        {
          "show_name": "The Morning After Mix",
          "show_description": "A crafted mix of carefully sequenced calm music to straighten you out.",
          "show_logo": "",
          "start_time": "04:00",
          "end_time": "06:00"
        },
        {
          "show_name": "Afrodeutsche",
          "show_description": "Let AFRODEUTSCHE provide the perfect, low-lit soundtrack for that first cup of coffee, turning your morning into a masterclass in calm.",
          "show_logo": "",
          "start_time": "06:00",
          "end_time": "08:00"
        },
        {
          "show_name": "Radcliffe and Maconie",
          "show_description": "Mark and Stuart present a feast of great music and chat for weekend breakfast.",
          "show_logo": "",
          "start_time": "08:00",
          "end_time": "10:00"
        },
        {
          "show_name": "Cerys Matthews",
          "show_description": "Cerys welcomes Steven Price to explore scoring Ocean with Attenborough, and Neil Brand shares insights from the Laurel & Hardy centenary, celebrating their timeless comic legacy.",
          "show_logo": "",
          "start_time": "10:00",
          "end_time": "13:00"
        },
        {
          "show_name": "Guy Garvey's Finest Hour",
          "show_description": "Guy chats to musician and songwriter Alexander Carson about Lord Byron, piano collecting and tricorn hats.",
          "show_logo": "",
          "start_time": "13:00",
          "end_time": "16:00"
        },
        {
          "show_name": "Iggy Pop",
          "show_description": "Iggy serves up a sonic cocktail to soundtrack your Sunday afternoon. This week, he's got key cuts by Smerz, Miles Davis, Zoé Basha, Richard Hawley and Angel Bat Dawid.",
          "show_logo": "",
          "start_time": "16:00",
          "end_time": "18:00"
        },
        {
          "show_name": "Mary Anne Hobbs",
          "show_description": "Mary Anne looks ahead to Tracey Emin's landmark exhibition A Second Life,  which opens at the Tate with words from Tate Director Maria Balshaw and Tracey Emin.",
          "show_logo": "",
          "start_time": "18:00",
          "end_time": "20:00"
        },
        {
          "show_name": "Stuart Maconie's Freak Zone",
          "show_description": "Stuart's featured album is Robert Wyatt's 1975 solo album Ruth is Stranger than Richard. Plus Jethro Tull, Sun Ra and Motorpyscho.",
          "show_logo": "",
          "start_time": "20:00",
          "end_time": "22:00"
        },
        {
          "show_name": "Dream Time",
          "show_description": "Your weekly trip through mystical musical realms guided by Zakia, sharing jazzy selections filled with saxophones and flutes, as well as words from a maestro of both - Shabaka.",
          "show_logo": "",
          "start_time": "22:00",
          "end_time": "00:00"
        }
      ]
    }
  ]
}