{
  "channel_name": "Smooth Radio",
  "channel_logo": "https://raw.githubusercontent.com/dp247/mediaportal-uk-logos/master/Radio/Smooth-Radio.png",
  "schedule": [
    {
      "date": "1 March 2026",
      "programmes": [
        {
          "show_name": "Philip Chryssikos",
          "show_description": "Philip Chryssikos plays the best music across the early hours at the weekend. Send a message to Philip on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "01:00",
          "end_time": "06:00"
        },
        {
          "show_name": "Eamonn Kelly",
          "show_description": "Eamonn Kelly gets your day off to the perfect start with the best music. Send a message to Eamonn on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "06:00",
          "end_time": "10:00"
        },
        {
          "show_name": "Angie Greaves",
          "show_description": "However you're spending your Sunday, Angie Greaves has the best music from 10am. Join Angie @smoothradio on socials to get in touch.",
          "show_logo": "",
          "start_time": "10:00",
          "end_time": "13:00"
        },
        {
          "show_name": "Tina Hobley",
          "show_description": "Tina Hobley has the best music. Send a message to Tina on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "13:00",
          "end_time": "16:00"
        },
        {
          "show_name": "Margherita Taylor",
          "show_description": "Margherita Taylor has the best music on a Sunday. Send a message to Margherita on your Alexa, just say... \"Alexa, send a comment to Smooth\"",
          "show_logo": "",
          "start_time": "16:00",
          "end_time": "19:00"
        },
        {
          "show_name": "Smooth Sanctuary",
          "show_description": "Unwind with the most relaxing music, in the Smooth Sanctuary with Gary Vincent. Send a message to Gary on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "19:00",
          "end_time": "22:00"
        },
        {
          "show_name": "Smooth Late Show",
          "show_description": "Danny Pietroni closes out the day with the most relaxing music on Smooth. Send a message to Danny on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "22:00",
          "end_time": "01:00"
        }
      ]
    },
    {
      "date": "2 March 2026",
      "programmes": [
        {
          "show_name": "Paul Hollins",
          "show_description": "Paul Hollins has the best music through the night until 4am. Send a message to Paul on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "01:00",
          "end_time": "04:00"
        },
        {
          "show_name": "Early Breakfast with Gary King",
          "show_description": "Gary King with the best songs to start the day on Smooth Radio. Send a message to Gary on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "04:00",
          "end_time": "06:00"
        },
        {
          "show_name": "Jenni Falconer",
          "show_description": "Start the day with Jenni Falconer as she kicks off Smooth's \"More Music Morning\". Wake up with Smooth on your Alexa, just say \"Alexa, play Smooth\"",
          "show_logo": "",
          "start_time": "06:00",
          "end_time": "10:00"
        },
        {
          "show_name": "Tina Hobley",
          "show_description": "Tina Hobley kicks off her show from 10am with an hour of non-stop music!  Send a message to Tina on your Alexa, just say... \"Alexa, send a comment to Smooth\"",
          "show_logo": "",
          "start_time": "10:00",
          "end_time": "13:00"
        },
        {
          "show_name": "Paul Phear",
          "show_description": "Paul Phear has the best music all afternoon. Send a message to Paul on your Alexa, just say... \"Alexa, send a comment to Smooth\"",
          "show_logo": "",
          "start_time": "13:00",
          "end_time": "16:00"
        },
        {
          "show_name": "Angie Greaves",
          "show_description": "Angie Greaves has the best music on Smooth. Send a message to Angie on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "16:00",
          "end_time": "19:00"
        },
        {
          "show_name": "Smooth Sanctuary",
          "show_description": "Unwind with the most relaxing music, in the Smooth Sanctuary with Darren Parks. Send a message to Darren on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "19:00",
          "end_time": "22:00"
        },
        {
          "show_name": "Smooth Late Show",
          "show_description": "Martin Collins closes out the day with the most relaxing music. Send a message to Martin on your Alexa, just say... \"Alexa, send a comment to Smooth Radio\"",
          "show_logo": "",
          "start_time": "22:00",
          "end_time": "01:00"
        }
      ]
    }
  ]
}